In [3]:
import sqlite3

In [4]:
connection = sqlite3.connect('chp17/books.db')

In [5]:
import pandas as pd

In [6]:
pd.options.display.max_columns = 10

In [7]:
pd.read_sql('SELECT * FROM authors',connection,index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [8]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

In [9]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection)

In [10]:
df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

In [11]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

In [12]:
pd.read_sql("""SELECT title, edition, copyright FROM titles WHERE copyright > '2016'""",connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

In [13]:
pd.read_sql("""SELECT id,first,last FROM authors WHERE last LIKE 'D%'""",connection,index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

In [14]:
pd.read_sql("""SELECT id, first, last FROM authors WHERE first LIKE '_b%'""",connection,index_col=['id'])

    first    last
id
3   Abbey  Deitel

In [15]:
pd.read_sql("""SELECT id, first, last FROM authors ORDER BY last,first""",connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [16]:
pd.read_sql("""SELECT id, first, last FROM authors ORDER BY last DESC,first ASC""",connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

In [17]:
pd.read_sql("""SELECT isbn, title, edition, copyright FROM titles WHERE title LIKE '%How to Program' ORDER BY title""",connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

In [18]:
pd.read_sql("""SELECT first, last, isbn FROM authors INNER JOIN author_ISBN ON authors.id = author_ISBN.id ORDER BY last, first""",connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

In [19]:
cursor = connection.cursor()

In [20]:
cursor = cursor.execute("""INSERT INTO authors (first,last) VALUES ('Sue','Red')""")

In [21]:
pd.read_sql('SELECT id,first,last FROM authors',connection,index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [22]:
curor =cursor.execute("""UPDATE authors SET last='Black'
WHERE last='RED' AND first='Sue'""")

In [23]:
pd.read_sql('SELECT id,first, last FROM authors',connection,index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [24]:
cursor.rowcount

0

In [25]:
pd.read_sql('SELECT id, first, last FROM authors', connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [26]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

In [27]:
cursor.rowcount

1

In [28]:
pd.read_sql('SELEct id, first, last FROM authors', connection,index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [29]:
conn = sqlite3.connect('chp17/books.db')
cursor = conn.cursor()

In [30]:
cursor.execute("SELECT last FROM authors ORDER BY last DESC")
authors_last_names = cursor.fetchall()
print("Authors' last names (descending order):", authors_last_names)

Authors' last names (descending order): [('Wald',), ('Quirk',), ('Deitel',), ('Deitel',), ('Deitel',)]

In [31]:
cursor.execute("SELECT title FROM titles ORDER BY title ASC")
titles = cursor.fetchall()
print("Book titles (ascending order):", titles)

Book titles (ascending order): [('Android 6 for Programmers',), ('Android How to Program',), ('C How to Program',), ('C++ How to Program',), ('Internet & WWW How to Program',), ('Intro to Python for CS and DS',), ('Java How to Program',), ('Visual Basic 2012 How to Program',), ('Visual C# How to Program',), ('Visual C++ How to Program',)]

In [32]:
cursor.execute("""
    SELECT titles.title, titles.copyright, titles.ISBN
    FROM titles
    INNER JOIN author_ISBN ON titles.ISBN = author_ISBN.ISBN
    WHERE title = 'Deitel'
    ORDER BY titles.title
""")
deitel_books = cursor.fetchall()
print("Books by Deitel:", deitel_books)

Books by Deitel: []

In [35]:
cursor.execute("INSERT INTO authors (first, last) VALUES (?, ?)", ('Stephen', 'King'))
conn.commit()
print("New author Stephen King added.")

OperationalError: database is locked

In [34]:
cursor.execute("INSERT INTO titles (title, copyright, ISBN) VALUES (?, ?, ?)", ('The Shining', 2022, '1234567890'))
conn.commit()
print("New title 'The Shining' added for Stephen King.")

OperationalError: database is locked